Revit 2027 API
FormattedText.SetItalicStatus Method
Overload List
Name | Description
SetItalicStatus(Boolean) |  Sets the characters in the entire text to be italic or not italic.
SetItalicStatus(TextRange, Boolean) |  Sets the characters in a given text range to be italic or not italic.
Top
See Also
Reference
FormattedText Class
Autodesk.Revit.DB Namespace